---
type: Field
namespace: Autodesk.Revit.DB.ExtensibleStorage
version: 2024
members: 14
tags: [revit-api, class]
---

# Field

`Autodesk.Revit.DB.ExtensibleStorage.Field` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CompatibleUnit | 2012 | `public bool CompatibleUnit ( ForgeTypeId unitTypeId )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSpecTypeId | 2012 | `public ForgeTypeId GetSpecTypeId ()` |
| Method | SubEntityReadAccessGranted | 2012 | `public bool SubEntityReadAccessGranted ()` |
| Method | SubEntityWriteAccessGranted | 2012 | `public bool SubEntityWriteAccessGranted ()` |
| Property | ContainerType | 2012 | `public ContainerType ContainerType { get ; }` |
| Property | Documentation | 2012 | `public string Documentation { get ; }` |
| Property | FieldName | 2012 | `public string FieldName { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | KeyType | 2012 | `public Type KeyType { get ; }` |
| Property | Schema | 2012 | `public Schema Schema { get ; }` |
| Property | SubSchema | 2012 | `public Schema SubSchema { get ; }` |
| Property | SubSchemaGUID | 2012 | `public Guid SubSchemaGUID { get ; }` |
| Property | ValueType | 2012 | `public Type ValueType { get ; }` |